# СИСТЕМЫ УПРАВЛЕНИЯ ПАКЕТАМИ
# Глава 18
"""
Система управления пакетами (менеджер пакетов) —
это программа, которая устанавливает другие программы и
управляет ими.
"""

# ПАКЕТЫ**********
"""
Пакет — это программное обеспечение, «упакованное» 
для распространения. Пакет включает файлы, из которых 
собственно состоит программа, и метаданные — информацию 
о данных вроде названия программного обеспечения, 
номера версии и зависимостей (программ, от которых 
зависит должная работа вашей программы). Для того чтобы 
загрузить и установить пакет на компьютер как 
программу, можно воспользоваться системой управления 
пакетами. Система управления пакетами управляет 
загрузкой всех зависимостей пакета.
"""
# Pip************
"""
bash
$ pip3 install requests
Это установка пакета requests для Python
"""
