# 1
muzykants = ["Высоцкий",
             "Макаревич",
             "Антонов",
             "Боярский"]

print(muzykants)
# 2
cities = [("Прокопьевск", (40.1, 90.2)),
          ("Короча", (30.5, 60.2)),
          ("Харьков", (30.2, 55.6)),
          ("Киев", (30, 50))]

print(cities)
# 3
my_self = {"имя": "Вячеслав",
           "рост": "185",
           "вес": "124",
           "цвет": "зеленый",
           "авто": "Infiniti"}
print(my_self)
# 4
my_data = input("Введите Ваши: имя, или рост, или вес, или цвет, или авто: ")
if my_data in my_self:
    result = my_self[my_data]
    print(result)
